# vim: set ft=ruby

cask_args appdir: '/Applications'
tap 'homebrew/cask'
brew 'mas'

brew 'git'
brew 'make'

tap 'neovim/neovim'
brew 'neovim', args: ['HEAD']

brew 'openssl'
brew 'jump'
brew 'coreutils'
brew 'gnu-tar'
brew 'fzf'
brew 'ripgrep'
brew 'wget'
brew 'curl'
brew 'jq'
brew 'tree'
brew 'gh'
brew 'awscli'
brew 'tldr'
brew 'bat'
brew 'moreutils'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'watch'
brew 'bash'
brew 'pgrep'
brew 'pkill'

cask 'alfred'
cask 'spotify'
cask 'vlc'
cask 'google-chrome'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'
